Public Attributes | List of all members
API_AnalyticalModelVariation Struct Reference
Analytical Model
Describes the Model Variation that is used for creating the Structural Analytical Model. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_Guid  | amVariationGuid
The unique identifier of the model state defining an analytical model variation.
Detailed Description
Describes the Model Variation that is used for creating the Structural Analytical Model.
Since
Archicad 26